for i in range(a,b,c): #Перебирает значение от a дo b с шагом c (если пусто, то 1)

if условие:
    функция1 #проверяет условие и если оно истинно выполняет условие 
elif: функция2#вложенное условие, выполняемое, если выражение ложно
else: функция3 #если условие ложно выполняет действие

input(функция) #выводит переменную на экран

int(функция) #меняет тип данных на целочисленный

str(функция) #меняет тип данных на строковый

break #завершает выполнение программы

from library import #импортирует библиотеки python

forward(шаг, пикс)# движение черепахи вперёд 

backward(шаг, пикс)#движение черепахи назад

right(угол, градус)# поворот черевахи направо

left (угол, градус) #поворот черевахи налево

dot(жирность)#ставит точку с радиусом, указанном в скобках

goto(x*a,y*b)#осуществляет переход к определённой точке в коде программы

def f(ввод переменных): #задаёт функцию 
    f = a #функция
f #вывод функции

count()#возвращает количество раз, когда указанный элемент появляется в списке

from library import part

product(?)#возвращает декартово произведение входных итерируемых последовательностей 

index(номер) #находит значение индекса элемента в последовательности

len(длинна)#возвращает количество элементов(длину) в обьекте

split(?) #разделяет строку на список подстроек по разделителю

join(?)#преобразует список в строку

append(?)#добавляет в список один новый элемент

with open('*.*') as f: #открывает фаил и аписывает его в функцию

readline(номер строки) #читает строку
